{
  "generalContext": "Through her various professional and private experiences Pauline has developed an extensive set of soft skills that play a relevant role in her candidate profile. First of all, by starting her working life early on, in a demanding field of restaurant industry, she has developed a high level of resilience and hard-work moral. Second of all, by immigrating to another country alone at age of 18, she has learned to be highly-adaptive and search for solutions for any type of problem that occurs unexpectedly. She is a fast responder and she is able to find solutions fast when needed and extensively when the complexity of the problem is bigger. Successfully adapting to a new culture and working in international environments, she has developed a fifth sense for humans, she can read them and meet them where they are, adapting to differences and potential challenges. Approaching people with empathy and curiosity is her strong side. She is always ready to help and willingly contributes to onboarding or helps in relevant matters when approach by either new colleagues, stakeholders or colleagues new to her work field. In a new work environment, she easily becomes one of the knowledgeable people who know how things work or where to look for advice or answers. She puts a lot of effort in networking, both internally, in the organisation, as well as externally. Maintaining good relations is important to her as she believes that common effort is highly valuable and it is possible to achieve more collaborating or working as a team. In her free time, she willingly attends various tech events, conferences and meet-ups. She is still very good friends with her colleagues from previous workplaces. She likes to be part of something bigger and contribute to a common wealth, as she finds it meaningful in life. Besides, she is open minded and tries her best to be constructive and remember not to take things too personally, as she understands that every human being come with their own luggage, whether it is organised or still under construction."
}
