{
  "masterthesisContext": "In light of the emerging global concern of cybersecurity, both governmental institutions and local organizations are enacting new regulations and guidelines. These have an aim of governing the security aspects of the digital world and the solutions within it. As a direct result of internet invention, several aspects of our lives have been transferred to the digital space. The digital transformation has had a profound influence on the world we live in. It has significantly optimized analog processes and contributed to globalization by boosting the global economy, migration, and international cooperation. At the same time, digitalization has brought the negative aspects of the analog world along. Through this metaphor, I strive to illustrate how crime can now be committed online just as easily as it is to handle civil matters on the internet. According to the Google Trends tool, the concept of cybersecurity only began to take shape around 2013, long after the invention of the internet. It was not until 2019 that the European Union began to negotiate issues regarding data protection and digital crime, which resulted in the establishment of relevant institutions within the EU, as well as the first legislation in the field. This thesis explores cybersecurity through a cultural and organizational perspective, intending to initiate a cybercultural change among developers in DFDS. DFDS is a Danish maritime company, making it a part of the critical European infrastructure for cyber safety, as per the new European Union cybersecurity directive – NIS2. The research case adopts a design-oriented pragmatic approach, encapsulated by Design Thinking, applying relevant design and organizational theories to craft a proposal for a digital solution that aligns with the thesis objective. This study incorporates a mix of both qualitative and quantitative data collection methods, including survey, interviews and user tests. The design process starts with a retrospective analysis of the relevant organizational and academic background to establish a solid foundation and understanding for further study. The process then shifts its focus to the present, staying human-centered, by gathering insights from the organization's developers and tech professionals iteratively. These insights support the process of defining the design situation by applying essential design knowledge and John Kotter's Eight Stage Model for organizational change. Further, the academic analysis of the collected data leads to establishing the initial prototype, which by the user testing, in the given organization, facilitates enhancements and adjustments. The conclusion of these activities occurs in a final solution proposal, that is human-centric and closely aligned with the actual practice, its needs and requirements. The final proposal for a digital solution aims to contribute to the organizational process of compliance with the NIS2 directive by supporting the mindset change. The cultural and awareness aspects of the new legislation are mentioned as one of the key elements of the compliance process by several relevant sources on the topic. The problem statement was as follows: How can cyber security awareness and culture be improved among web developers in DFDS so that their behaviour efforts support the process of NIS/NIS2 compliance? The thesis is confidential and written in Danish due to the nature of the master programme."
}
