{
  "professionalContext": "Pauline is a young software engineer with a lot of drive, energy and curiosity. She thrives when dedicated to a product or idea. She is highly adaptive, clever, has a spark and an open mind. She loves to learn new things, especially languages, the spoken ones and ones to develop software with. Besides, she loves to learn about trains and planes, other cultures and spiritual ideas. She started her work life as a dishwasher at the age of 14, afterwards she also served as kitchen-help in high-volume restaurants in her hometown of Swinoujscie - small island on the Baltic Sea. During her studies, she earned her living by waitressing (& everything else) - in both chill cafe/bistro set-ups and and high-dynamic cocktailbars and even a castle as a wedding waiter. She has therefore learned to be highly adaptive and that has shaped her to be a diverse and curious tech girl. Having a core competency skillset is important to her, yet she never stops being curious and wanting to immerse into new fields of technology. Today her core competencies lie in frontend development, where she masters React and has experience with relevant frontend frameworks (as stated in the CV). Besides, she has a broad non-technical expertise and interest in cyber security and its raising significance in the world. As per her work experience, she had been working hands-on with UX/UI, migrating Cloud and automatisation, as well as agile methodologies. She has also touched a bit upon baked development - within C# and .NET as well as WPF and SQL. She currently dives into a better understanding of RAG, LLMs and Python. As per professional experience, she has been pursuing web development actively since 2020, corona outreach, where she took a technical education in web development at Roskilde Technical School (https://www.rts.dk/eud-erhvervsuddannelser/erhvervsuddannelser-eud/146-webudvikler). Since than she started working in digital marketing for smaller sized companies on student positions, pursuing to land her first software development job. This occurred in the beginning of 2023, when she started as a Student Frontend Developer in DFDS (https://www.dfds.com/en/about). Meanwhile she also pursued her Master’s of IT in IT, learning and organisational change, graduating with next-highest grade for a project about cyber security awareness among developers. Afterwards she started as a fulltime Software Engineer at TV2 Denmark (TV 2 Denmark is a danish public service broadcaster providing news, entertainment, sports, and streaming to most of the danish population. TV2 Connect is a self-service platform for advertisers, allowing businesses to easily book campaigns on streaming services like TV2 Play and Disney+. Part of TV2 Reklame.) where she pursued learning and growing for a year. Later she felt the need to redefine her work-life and balance it out."
}
